module CourseCrawler::Crawlers
class TutCourseCrawler < CourseCrawler::Base
  # 從網頁直接複製下來，極致極限霸氣
  CLAS = [ ['D11211','四容一Ａ'], ['D11212','四容一Ｂ'], ['D11220','四容二'], ['D11221','四容二Ａ'], ['D11222','四容二Ｂ'], ['D11231','四容三Ａ'], ['D11232','四容三Ｂ'], ['D11241','四容四Ａ'], ['D11242','四容四Ｂ'], ['D11511','四幼一Ａ'], ['D11512','四幼一Ｂ'], ['D11521','四幼二Ａ'], ['D11522','四幼二Ｂ'], ['D11531','四幼三Ａ'], ['D11532','四幼三Ｂ'], ['D11541','四幼四Ａ'], ['D11542','四幼四Ｂ'], ['D12811','四服一Ａ'], ['D12812','四服一Ｂ'], ['D12813','四服一Ｃ'], ['D12820','四服二'], ['D12821','四服二Ａ'], ['D12822','四服二Ｂ'], ['D12823','四服二Ｃ'], ['D12831','四服三Ａ'], ['D12832','四服三Ｂ'], ['D12833','四服三Ｃ'], ['D12841','四服四Ａ'], ['D12842','四服四Ｂ'], ['D12843','四服四Ｃ'], ['D13411','四餐一Ａ'], ['D13412','四餐一Ｂ'], ['D13420','四餐二'], ['D13421','四餐二Ａ'], ['D13422','四餐二Ｂ'], ['D13431','四餐三Ａ'], ['D13432','四餐三Ｂ'], ['D13441','四餐四Ａ'], ['D13442','四餐四Ｂ'], ['D13511','四尚一Ａ'], ['D13512','四尚一Ｂ'], ['D13520','四尚二'], ['D13521','四尚二Ａ'], ['D13522','四尚二Ｂ'], ['D13531','四尚三Ａ'], ['D13532','四尚三Ｂ'], ['D13541','四尚四Ａ'], ['D13542','四尚四Ｂ'], ['D14011','四生一Ａ'], ['D14012','四生一Ｂ'], ['D14020','四生二'], ['D14021','四生二Ａ'], ['D14022','四生二Ｂ'], ['D14031','四生三Ａ'], ['D14032','四生三Ｂ'], ['D14041','四生四Ａ'], ['D14042','四生四Ｂ'], ['D14120','四運二'], ['D14121','四運二Ａ'], ['D14122','四運二Ｂ'], ['D14131','四運三Ａ'], ['D14132','四運三Ｂ'], ['D14141','四運四Ａ'], ['D14142','四運四Ｂ'], ['D15211','四運一Ａ'], ['D15212','四運一Ｂ'], ['D21011','四財一Ａ'], ['D21012','四財一Ｂ'], ['D21020','四財二'], ['D21021','四財二Ａ'], ['D21022','四財二Ｂ'], ['D21031','四財三Ａ'], ['D21032','四財三Ｂ'], ['D21041','四財四Ａ'], ['D21042','四財四Ｂ'], ['D21720','四會二'], ['D21721','四會二Ａ'], ['D21731','四會三Ａ'], ['D21741','四會四Ａ'], ['D21811','四企一Ａ'], ['D21812','四企一Ｂ'], ['D21820','四企二'], ['D21821','四企二Ａ'], ['D21822','四企二Ｂ'], ['D21831','四企三Ａ'], ['D21832','四企三Ｂ'], ['D21841','四企四Ａ'], ['D21842','四企四Ｂ'], ['D22211','四資一Ａ'], ['D22212','四資一Ｂ'], ['D22220','四資二'], ['D22221','四資二Ａ'], ['D22222','四資二Ｂ'], ['D22231','四資三Ａ'], ['D22232','四資三Ｂ'], ['D22241','四資四Ａ'], ['D22242','四資四Ｂ'], ['D23611','四管一Ａ'], ['D23612','四管一Ｂ'], ['D23620','四管二'], ['D23621','四管二Ａ'], ['D23622','四管二Ｂ'], ['D23631','四管三Ａ'], ['D23632','四管三Ｂ'], ['D23641','四管四Ａ'], ['D23642','四管四Ｂ'], ['D23841','四旅四Ａ'], ['D23842','四旅四Ｂ'], ['D23843','四旅四Ｃ'], ['D24541','四英四Ａ'], ['D24542','四英四Ｂ'], ['D30411','四商一Ａ'], ['D30412','四商一Ｂ'], ['D30413','四商一Ｃ'], ['D30420','四商二'], ['D30421','四商二Ａ'], ['D30422','四商二Ｂ'], ['D30423','四商二Ｃ'], ['D30431','四商三Ａ'], ['D30432','四商三Ｂ'], ['D30433','四商三Ｃ'], ['D30441','四商四Ａ'], ['D30442','四商四Ｂ'], ['D30443','四商四Ｃ'], ['D30611','四室一Ａ'], ['D30612','四室一Ｂ'], ['D30621','四室二Ａ'], ['D30622','四室二Ｂ'], ['D30631','四室三Ａ'], ['D30632','四室三Ｂ'], ['D30641','四室四Ａ'], ['D30642','四室四Ｂ'], ['D32111','四傳一Ａ'], ['D32112','四傳一Ｂ'], ['D32120','四傳二'], ['D32121','四傳二Ａ'], ['D32122','四傳二Ｂ'], ['D32123','四傳二Ｃ'], ['D32131','四傳三Ａ'], ['D32132','四傳三Ｂ'], ['D32141','四傳四Ａ'], ['D32142','四傳四Ｂ'], ['D33711','四動一Ａ'], ['D33712','四動一Ｂ'], ['D33721','四動二Ａ'], ['D33731','四動三Ａ'], ['D33741','四動四Ａ'], ['D40711','四舞一Ａ'], ['D40721','四舞二Ａ'], ['D40731','四舞三Ａ'], ['D40741','四舞四Ａ'], ['D41311','四美一Ａ'], ['D41312','四美一Ｂ'], ['D41313','四美一Ｃ'], ['D41320','四美二'], ['D41321','四美二Ａ'], ['D41322','四美二Ｂ'], ['D41323','四美二Ｃ'], ['D41331','四美三Ａ'], ['D41332','四美三Ｂ'], ['D41341','四美四Ａ'], ['D41342','四美四Ｂ'], ['D51711','四會一Ａ'], ['D53831','四旅三Ａ'], ['D53832','四旅三Ｂ'], ['D53833','四旅三Ｃ'], ['D54511','四英一Ａ'], ['D54512','四英一Ｂ'], ['D54520','四英二'], ['D54521','四英二Ａ'], ['D54522','四英二Ｂ'], ['D54530','四英三'], ['D54531','四英三Ａ'], ['D54532','四英三Ｂ'], ['D54911','四養一Ａ'], ['D54921','四養二Ａ'], ['D54931','四養三Ａ'], ['D55111','四旅一Ａ'], ['D55112','四旅一Ｂ'], ['D55113','四旅一Ｃ'], ['D55121','四旅二Ａ'], ['D55122','四旅二Ｂ'], ['D55123','四旅二Ｃ'], ['EA11','中教一Ａ'], ['EA21','中教二Ａ'], ['EB11','幼教一Ａ'], ['EB12','幼教一Ｂ'], ['EB21','幼教二Ａ'], ['EB22','幼教二Ｂ'], ['C11231','容三Ａ'], ['C11241','容四Ａ'], ['C11531','幼三Ａ'], ['C11541','幼四Ａ'], ['C12841','服四Ａ'], ['C13430','餐三'], ['C13431','餐三Ａ'], ['C13441','餐四Ａ'], ['C22241','資四Ａ'], ['C30441','商四Ａ'], ['C55131','旅三Ａ'], ['C55141','旅四Ａ'], ['740510','七音一'], ['740511','七音一Ａ'], ['740512','七音一Ｂ'], ['740521','七音二Ａ'], ['740522','七音二Ｂ'], ['740531','七音三Ａ'], ['740532','七音三Ｂ'], ['740541','七音四Ａ'], ['740542','七音四Ｂ'], ['740551','七音五Ａ'], ['740552','七音五Ｂ'], ['740561','七音六Ａ'], ['740562','七音六Ｂ'], ['740571','七音七Ａ'], ['740572','七音七Ｂ'], ['740710','七舞一'], ['740711','七舞一Ａ'], ['740721','七舞二Ａ'], ['740731','七舞三Ａ'], ['740741','七舞四Ａ'], ['740751','七舞五Ａ'], ['740761','七舞六Ａ'], ['740771','七舞七Ａ'], ['741310','七美一'], ['741311','七美一Ａ'], ['741312','七美一Ｂ'], ['741321','七美二Ａ'], ['741322','七美二Ｂ'], ['741331','七美三Ａ'], ['741332','七美三Ｂ'], ['741341','七美四Ａ'], ['741342','七美四Ｂ'], ['741351','七美五Ａ'], ['741352','七美五Ｂ'], ['741361','七美六Ａ'], ['741362','七美六Ｂ'], ['741371','七美七Ａ'], ['741372','七美七Ｂ'], ['510351','服五甲'], ['530651','室五甲'], ['531151','傳五甲'], ['532951','商五甲'], ['A10121','生研二'], ['A15011','生研一'], ['A15021','生研二'], ['A20211','會資研一'], ['A20911','商管研一'], ['A24711','國企研一'], ['A24721','國企研二'], ['A34611','視傳研一'], ['A34621','視傳研二'], ['A44211','音研一'], ['A44221','音研二'], ['A44311','美研一'], ['A44321','美研二'], ['EA11','中教一Ａ'], ['EA21','中教二Ａ'], ['EB11','幼教一Ａ'], ['EB12','幼教一Ｂ'], ['EB21','幼教二Ａ'], ['EB22','幼教二Ｂ'], ['Q611','室一Ａ'], ['Q621','室二Ａ'], ['Q631','室三Ａ'], ['Q641','室四Ａ'], ['Q841','企四Ａ'], ['Q941','財四Ａ'], ['QC11','美一Ａ'], ['QC21','美二Ａ'], ['QC31','美三Ａ'], ['QC41','美四Ａ'], ['QD11','傳一Ａ'], ['QD21','傳二Ａ'], ['QD31','傳三Ａ'], ['QD41','傳四Ａ'], ['QE11','容一Ａ'], ['QE12','容一Ｂ'], ['QE21','容二Ａ'], ['QE31','容三Ａ'], ['QE32','容三Ｂ'], ['QE41','容四Ａ'], ['QE42','容四Ｂ'], ['QG11','品一Ａ'], ['QG21','品二Ａ'], ['QG31','品三Ａ'], ['QG41','品四Ａ'], ['QJ11','資一Ａ'], ['QJ21','資二Ａ'], ['QJ31','資三Ａ'], ['QJ41','資四Ａ'], ['QK41','生四Ａ'], ['QK42','生四Ｂ'], ['QL11','服一Ａ'], ['QL21','服二Ａ'], ['QL31','服三Ａ'], ['QL41','服四Ａ'], ['QN11','餐一Ａ'], ['QN12','餐一Ｂ'], ['QN13','餐一Ｃ'], ['QN21','餐二Ａ'], ['QN22','餐二Ｂ'], ['QN23','餐二Ｃ'], ['QN31','餐三Ａ'], ['QN32','餐三Ｂ'], ['QN33','餐三Ｃ'], ['QN41','餐四Ａ'], ['QN42','餐四Ｂ'], ['QN43','餐四Ｃ'], ['QP11','養一Ａ'], ['QP21','養二Ａ'], ['QP31','養三Ａ'], ['QQ31','銀三Ａ'], ['QQ41','銀四Ａ'], ['QR11','旅一Ａ'], ['QR21','旅二Ａ'], ['QR31','旅三Ａ'], ['QT11','生一Ａ'], ['QT21','生二Ａ'], ['QT31','生三Ａ'], ['QT41','生四Ａ'], ['QU11','尚一Ａ'], ['QU21','尚二Ａ'], ['QU31','尚三Ａ'], ['QU41','尚四Ａ'], ['QV11','運一Ａ'], ['QV21','運二Ａ'], ['QV31','運三Ａ'], ['QV41','運四Ａ'], ['QW11','管一Ａ'], ['QW21','管二Ａ'], ['QW31','管三Ａ'], ['QW41','管四Ａ'], ['QX11','英一Ａ'], ['QX21','英二Ａ'], ['QX31','英三Ａ'], ['QX41','英四Ａ'], ['QY31','微三Ａ'], ['QY41','微四Ａ'], ['YE11','外校一Ａ'], ['PE36','容三Ｆ'], ['PE46','容四Ｆ'], ['PF36','幼三Ｆ'], ['PF46','幼四Ｆ'], ['PJ36','資三Ｆ'], ['PJ46','資四Ｆ'], ['PN36','餐三Ｆ'], ['PN46','餐四Ｆ'], ['PX36','英三Ｆ'], ['PX46','英四Ｆ'], ['B101-1','陸生'], ['B101-2','陸生'], ['B101-3','陸生(閩台專班)'], ['B101-4','陸生'], ['B102-1','陸生'], ['B102-2','陸生'], ['B102-3','陸生(閩台)'], ['B102-4','陸生'], ['B103-1','陸生A班'], ['B103-2','陸生B班'], ['B103-3','陸生'], ['B103-4','陸生(閩台多動)'], ['B103-5','陸生(閩台視傳)'], ['B103-6','陸生'], ['B104-1','陸生A班'], ['B104-2','陸生B班'], ['B104-3','陸生'], ['SE1010','幼二技'], ['SE1020','幼二技'], ['SE103-1','四技A班'], ['SE103-2','四技B班'], ['SE104','四技學分班'], ['SE233','幼三E'], ['SE234','幼三E'], ['U1030','非在籍'], ['U1040','非在籍'], ['H97','生研ㄧ'], ['H97-1','商管一'], ['H97-2','美研ㄧ'], ['H97-3','應研一'], ['H97-4','視研一'], ['HK102-1','國企一'], ['113','英語研習-觀光英語會'], ['1A11','國民小學課後照顧服務'], ['1B11','專長增能學分班─烘焙'], ['1B12','專長增能學分班-烘焙'], ['1B13','專長增能-烘焙'], ['1C11','幼專二A'], ['1C12','幼專二A'], ['1C13','幼專二A'], ['1C14','幼專二A'], ['1C15','幼專二A'], ['1C16','幼專一A'], ['1C17','幼專一B'], ['1D11','應用音樂'], ['1D12','應用藝術'], ['1D21','應用音樂'], ['1D22','環境藝術'], ['1E11','第二專長英語'], ['1E21','第二專長家政'], ['1E22','第二專長家政'], ['1E23','第二專長家政'], ['1E24','第二專長-家政'], ['1E25','第二專長家政'], ['1E26','第二專長家政'], ['1E31','第二專長視覺藝術'], ['1F11','藝術與人文-音樂'], ['1F21','藝術與人文-視覺藝術'], ['1F22','藝術與人文-視覺藝術'], ['1F31','綜合活動-家政'], ['1F32','綜合活動-家政'], ['1F33','綜合活動─家政'], ['1F41','綜合活動-童軍'], ['1F51','綜合活動-輔導活動'], ['1G11','全民英檢'], ['1G12','全民英檢'], ['1H11','軍訓教官'], ['1H12','軍訓教官'], ['1H13','軍訓教官'], ['1H14','軍訓教官'], ['1H15','軍訓教官'], ['1H16','軍訓教官'], ['1H17','軍訓教官'], ['1H18','軍訓教官'], ['1H19','軍訓教官'], ['1I11','旅遊實用英語'], ['1I12','旅遊實用英語'], ['1J11','菁華版250針技課程'], ['1L11','專長增能-英語聽講訓'], ['1L12','英語研習-英語聽講訓'], ['1M11','機械手臂刺繡專班'], ['1R11','古修畫修復士'], ['1R12','古修畫修復士'], ['1S12','專長增能-中式點心'], ['1S13','專長增能-中式點心'], ['1T11','第二專長-表演藝術'], ['1T12','第二專長-表演藝術'], ['1U10','非在籍班'], ['1U11','非在籍班'], ['1U12','非在籍班'], ['1U13','非在籍班'], ['1U14','非在籍班'], ['1V11','觀光英語會話'], ['1V12','專長增能-觀光英語會'], ['1V13','英語研習-觀光英語會'], ['1Y11','有氧體適能'], ['1Z11','生命教育專長增能學分'], ['EA01','中教一Ａ'], ['EA02','中教二Ａ'], ['EB01','幼教一Ａ'], ['EB02','幼教一Ｂ'], ['EB03','幼教二Ａ'], ['EB04','幼教二Ｂ'], ['P541','音四Ｓ'], ['P551','音五Ｓ'], ['PD31','傳三Ｓ'], ['PD41','傳四Ｓ'], ['PR31','課三Ｓ'], ['PR41','課四Ｓ'], ['PS31','幼三Ｓ'], ['PS41','幼四ＳＡ'], ['PS42','幼四ＳＢ'], ['RC11','容一Ｒ'], ['RC21','容二Ｒ'], ['RC31','容三Ｒ'], ['RC41','容四Ｒ'], ['RV11','運一Ｒ'], ['RV21','運二Ｒ'], ['RV31','運三Ｒ'], ['RW12','管一Ｒ'], ['RW22','管二Ｒ'], ['SN31','幼三Ｓ'], ['SN41','幼四Ｓ'], ['M811','國企所一Ｍ'], ['M821','國企所二Ｍ'], ['MA11','音研所一Ｍ'], ['MA21','音研所二Ｍ'], ['MA31','音研所三Ｍ'], ['MB11','美研所一Ｍ'], ['MB21','美研所二Ｍ'], ['MB31','美研所三Ｍ'], ['MK21','生研所二Ｍ'], ['MP11','視傳所一Ｍ'], ['MP21','視傳所二Ｍ'], ['MT11','生研所一Ｍ'], ['MT21','生研所二Ｍ'], ['YM11','外校-碩士班'], ['HE11','容一Ｈ'], ['HW11','管一Ｈ'], ['HW21','管二Ｈ'], ['HW31','管三Ｈ'], ['HW41','管四Ｈ'],
  ]

  DAYS = {
    "一" => 1,
    "二" => 2,
    "三" => 3,
    "四" => 4,
    "五" => 5,
    "六" => 6,
    "日" => 7,
  }

  def initialize year: nil, term: nil, update_progress: nil, after_each: nil

    @year = year
    @term = term
    @update_progress_proc = update_progress
    @after_each_proc = after_each

    @query_url = "http://student.tut.edu.tw/sc2008/STPJ/STPJ_S_SUB\(TZU\).ASP"
    @ic = Iconv.new('utf-8//IGNORE//translit', 'big5')
    # CLNO=
  end

  def courses
    @courses = []

    CLAS.each do |data_arr|
      clas_no, clas_name = data_arr

      r = http_client.get("#{@query_url}?CLNO=#{clas_no}")
      doc = Nokogiri::HTML(@ic.iconv(r.body))

      course_list_table, time_table = doc.css('table')

      year, term = nil, nil
      time_table.css('tr font[size="3"]').text.match(/(?<year>\d+)學年度第(?<term>\d)學期/) do |m|
        year = m[:year].to_i + 1911
        term = m[:term].to_i
      end

      course_list_table.css('tr:nth-child(n+3)').each do |row|
        next if power_strip(row.text).empty?
        datas = row.xpath('td')

        general_code = datas[1].css('font[color="#FF0000"]').text
        required     = datas[2].css('font[color="#FF0000"]').text.include?('必修')
        credits      = power_strip(datas[3].text).to_i
        lecturer     = datas[5].css('font[color="#000000"]').text
        location     = power_strip(datas[6].text)

        datas[1].search('br').each{|br| br.replace("\n")}
        name = datas[1].text.split("\n")[1]

        # 星期一第5,6節，星期二第2節。
        # scan result: [["一", "5,6"], ["二", "2"]]
        course_days, course_periods, course_locations = [], [], []
        datas[8].text.scan(%r{星期([#{DAYS.keys.join}])第(.+?)節}).each do |m|
          m[1].split(',').map(&:to_i).each do |p|
            course_days << DAYS[m[0]]
            course_periods << p
            course_locations << location
          end
        end

        course = {
          :year            => year,    # 西元年
          :term            => term,    # 學期 (第一學期=1，第二學期=2)
          :name            => name,    # 課程名稱
          :lecturer        => lecturer,    # 授課教師
          :credits         => credits,    # 學分數
          :code            => "#{year}-#{term}-#{general_code}",
          # :general_code  => data[0],    # 選課代碼
          :general_code    => general_code,
          # :url             => syllabus_url,    # 課程大綱之類的連結(如果有的話)
          :required        => required,    # 必修或選修
          # :department      => dep_n,    # 開課系所
          # :department_code => dep_c,
          :day_1           => course_days[0],
          :day_2           => course_days[1],
          :day_3           => course_days[2],
          :day_4           => course_days[3],
          :day_5           => course_days[4],
          :day_6           => course_days[5],
          :day_7           => course_days[6],
          :day_8           => course_days[7],
          :day_9           => course_days[8],
          :period_1        => course_periods[0],
          :period_2        => course_periods[1],
          :period_3        => course_periods[2],
          :period_4        => course_periods[3],
          :period_5        => course_periods[4],
          :period_6        => course_periods[5],
          :period_7        => course_periods[6],
          :period_8        => course_periods[7],
          :period_9        => course_periods[8],
          :location_1      => course_locations[0],
          :location_2      => course_locations[1],
          :location_3      => course_locations[2],
          :location_4      => course_locations[3],
          :location_5      => course_locations[4],
          :location_6      => course_locations[5],
          :location_7      => course_locations[6],
          :location_8      => course_locations[7],
          :location_9      => course_locations[8],
        }

        @courses << course
      end
    end

    @courses
  end
end
end
